<?php defined('SYSPATH') or die('No direct script access.');

class Model_Admin_ModelPresets extends Model {

public function make_translit($string) {

        $converter = array(
            'а' => 'a',   'б' => 'b',   'в' => 'v',
            'г' => 'g',   'д' => 'd',   'е' => 'e',
            'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
            'и' => 'i',   'й' => 'y',   'к' => 'k',
            'л' => 'l',   'м' => 'm',   'н' => 'n',
            'о' => 'o',   'п' => 'p',   'р' => 'r',
            'с' => 's',   'т' => 't',   'у' => 'u',
            'ф' => 'f',   'х' => 'h',   'ц' => 'c',
            'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
            'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
            'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
            // AZ
            'ə' => 'e',   'ı' => 'i',   'х' => 'h',
            'c' => 'dz',  'ç' => 'ch',  'ş' => 'sh',
            'ğ' => 'gh',  'ö' => 'o',   'ü' => 'u',

            
            'А' => 'A',   'Б' => 'B',   'В' => 'V',
            'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
            'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
            'И' => 'I',   'Й' => 'Y',   'К' => 'K',
            'Л' => 'L',   'М' => 'M',   'Н' => 'N',
            'О' => 'O',   'П' => 'P',   'Р' => 'R',
            'С' => 'S',   'Т' => 'T',   'У' => 'U',
            'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
            'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
            'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
            'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
            // AZ
            'Ə' => 'E',   'I' => 'I',   'X' => 'H',
            'C' => 'Dz',  'Ç' => 'Ch',  'Ş' => 'Sh',
            'Ğ' => 'Gh',  'Ö' => 'O',   'Ü' => 'U',
            'İ' => 'I',   '"' => '_',   '/' => '_',
            '~' => '_',   '`' => '_',    
        );

        return strtr($string, $converter);

    }
    
    public function str2url($str) {
        // переводим в транслит
        $str = $this->make_translit($str);
        // в нижний регистр
        $str = strtolower($str);
        // заменям все ненужное нам на "-"
        $str = preg_replace('~[^-a-z0-9_]+~u', '-', $str);
        // удаляем начальные и конечные '-'
        $str = trim($str, "-");

        return $str;
    }       

}


